JCDS 0412 - 22/10/2024 <br>
Basic Pandas

**Module 2: Basic Pandas (Create Series, Create DataFrame, and Indexing)**

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create Series From List
total_revenue = [2.3, 7.3, 3.5, 4.8, 10.0, 12.0, 1.0]
series_tot_rev = pd.Series(total_revenue, name="Total Revenue")
# pd.Series(total_revenue, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g']) # Add Custom Index
series_tot_rev

0     2.3
1     7.3
2     3.5
3     4.8
4    10.0
5    12.0
6     1.0
Name: Total Revenue, dtype: float64

In [3]:
# Create Series From Dictionary
total_revenue = {'Jakarta':2.3, 'Bandung' : 2.3, 'Semarang':3.5,
                'Surabaya':4.8, 'Yogyakarta':10.0, 'Malang': 12.0,
                'Depok':1.0}

series_tot_rev = pd.Series(total_revenue, name= "Total Revenue by City")
series_tot_rev

Jakarta        2.3
Bandung        2.3
Semarang       3.5
Surabaya       4.8
Yogyakarta    10.0
Malang        12.0
Depok          1.0
Name: Total Revenue by City, dtype: float64

In [4]:
# Series Attributes
# Name
print(series_tot_rev.name)
# Shape
print(series_tot_rev.shape)
# Type
print(series_tot_rev.dtype)
# Size
print(series_tot_rev.size)

Total Revenue by City
(7,)
float64
7

In [5]:
# Create DataFrame from list
total_revenue = [["Jakarta", 2.3],
                 ["Bandung", 7.3],
                 ["Semarang", 3.5],
                 ["Surabaya", 4.8],
                 ["Yogyakarta", 10],
                 ["Malang", 12.0],
                 ["Depok", 1.0]]

df = pd.DataFrame(total_revenue, columns = ['City', 'Total Revenue'])
df

         City  Total Revenue
0     Jakarta            2.3
1     Bandung            7.3
2    Semarang            3.5
3    Surabaya            4.8
4  Yogyakarta           10.0
5      Malang           12.0
6       Depok            1.0

In [6]:
# Create DataFrame from Dictionary
# KeyDictionary -> Column
# ValueDictionary -> Row
total_revenue = {'City':['Jakarta', 'Bandung', 'Semarang', 'Surabaya', 
                       'Yogyakarta', 'Malang', 'Depok'],
                'Total Revenue': [2.3, 7.3, 3.5, 4.8, 10.0, 12.0, 1.0]}

df = pd.DataFrame(total_revenue)
df

         City  Total Revenue
0     Jakarta            2.3
1     Bandung            7.3
2    Semarang            3.5
3    Surabaya            4.8
4  Yogyakarta           10.0
5      Malang           12.0
6       Depok            1.0

In [7]:
# DataFrame Atributes
# shape
print(df.shape)
# columns
print(df.columns)
# values
print(df.values)
# dtypes
print(df.dtypes)
# size
print(df.size)

(7, 2)
Index(['City', 'Total Revenue'], dtype='object')
[['Jakarta' 2.3]
 ['Bandung' 7.3]
 ['Semarang' 3.5]
 ['Surabaya' 4.8]
 ['Yogyakarta' 10.0]
 ['Malang' 12.0]
 ['Depok' 1.0]]
City              object
Total Revenue    float64
dtype: object
14

In [10]:
# Fancy Indexing
# Label-Based Indexing -> df.loc[row_label, col_label]
# Position-Based Indexing -> df.iloc[row, col]

total_revenue = {'City ID':['C01','C02','C03', 'C04', 'C05', 'C06', 'C07'],
                'City':['Jakarta', 'Bandung', 'Semarang', 'Surabaya', 
                        'Yogyakarta', 'Malang', 'Depok'],
                'Total Revenue': [2.3, 7.3, 3.5, 4.8, 10.0, 12.0, 1.0],
                'Region Manager': ['Person A', 'Person A', 'Person B', 'Person C', 'Person B', 'Person C', 'Person A']}

df = pd.DataFrame(total_revenue)
df

  City ID        City  Total Revenue Region Manager
0     C01     Jakarta            2.3       Person A
1     C02     Bandung            7.3       Person A
2     C03    Semarang            3.5       Person B
3     C04    Surabaya            4.8       Person C
4     C05  Yogyakarta           10.0       Person B
5     C06      Malang           12.0       Person C
6     C07       Depok            1.0       Person A

In [12]:
# Set Index
# df = df.set_index('City ID')
df.set_index('City ID', inplace=True) # Menerapkan perubahan pada data frame aslinya

In [14]:
df['City']

City ID
C01       Jakarta
C02       Bandung
C03      Semarang
C04      Surabaya
C05    Yogyakarta
C06        Malang
C07         Depok
Name: City, dtype: object